user_tutorial/thermFluidStructOptFoam/thermFluidStructOpt_2D_180deg/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            groovyBC;			// This function allows a step change in pressure controlled by solve_ext Boolean
        variables
        (
            "p_op=max(p_operating_field);"	// Solver-updated operating pressure (controls found in transportProperties dictionary)
        );
        valueExpression "p_op";				// Resulting kinematic pressure
        value           uniform 0;
    }

    walls
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }

    force_out
    {
        type            zeroGradient;
    }

    force_in
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
