user_tutorial/thermFluidStructOptFoam/thermFluidStructOpt_2D_180deg/constant/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

E                	7.31E+10;		// Elastic modulus
Po                  0.33;			// Poisson's Ratio
planeStress         no;				// Is plane stress included?

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
