user_tutorial/thermFluidStructOptFoam/thermFluidStructOpt_2D_180deg/constant/optimizationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      optimizationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Domain definition
solve_ext				0;          // Boolean used to switch between internal and external optimizer
solid_area              1;          // Is solid region used? (1=yes)
fluid_area              1;          // Is fluid region used? (1=yes)
test_area               0;          // Is test region used? (1=yes)
geo_dim                 2;          // Dimensions of solver (2D vs. 3D)

// Method of Moving Asymptotes (MMA) controls
mma_init                0.3;        // Initial optimization increment
mma_dec                 0.9999;     // Optimization decrement
mma_inc                 1.0001;     // Optimization increment
mma_limit               0.4;        // Optimization limit
raa0                    1.0e-06;    // MMA smoothing parameter
r_filter                1;          // Density filter radius

// RAMP function constant (increases transition rate between fluid and solid)
q_ramp_init             1.0e-04;	// Initial shape factor used to scale ramp function
q_ramp_limit            0.010;		// Shape factor limit
dq_ramp                 10.0;       // Percent increase rate for shape factor (near convergence)
n_rapid                 10.0;       // Factor that controls when to increase q_ramp based on proximity to convergence

// Cost function constraints
//power_loss_ref          1.0;    // Power loss reference
power_loss_ref          9.0e-05;    // Power loss reference
//compliance_ref         	1.0;	// Compliance reference
compliance_ref         	7.48e-13;	// Compliance reference
set_power_ratio         30.0;       // Target power loss ratio
set_compliance          3.0;		// Target compliance ratio
vol_frac_ref            0.36;       // Reference volume fraction
vol_frac_ratio          1.0;        // Ratio used to calculate the set volume fraction
set_vol_frac_solid      0.6;        // Target volume fraction for region remaining after initial optimization

// Optimization weights
weight_sens_TU			1.0;        // Sensitivity weight for thermal velocity term
weight_sens_TK			-1.0;       // Sensitivity weight for thermal conductivity term
weight_sens_TQ			-1.0;       // Sensitivity weight for heat generation term
weight_sens_TT			1.0;        // Sensitivity weight for thermal diffusivity term
weight_sens_T			1.0;        // Sensitivity weight for thermal term
weight_sens_U			1.0;        // Sensitivity weight for velocity term
weight_sens_comp		1.0;        // Sensitivity weight for compliance term
weight_sens_vf			1.0;        // Sensitivity weight for volume fraction term
weight_sens_tot			1.0;		// Sensitivity weight for all terms

// Convergence controls
n_flow_solve			50;			// Number of iterations used for solver per optimization loop
conv_tol_flow			1.0e-06;	// Convergence threshold for fluid solver
merit_tol				0.001;		// Convergence tolerance for merit parameters
gamma_tol				0.001;		// Convergence tolerance for pseudo density gamma
