user_tutorial/thermFluidStructOptFoam/thermFluidStructOpt_2D_180deg/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

// the updated blockMesh (openfoam.com) fails on some meshes with default options;
// it reports report inconsistent number of faces although the mesh is still OK.
// this happens where two 'wedge' blocks with different numbers of cells join in the same
// point/edge.
mergeType points;
checkFaceCorrespondence false;



vertices
(
    
    (0.00000000 0.00000000 -0.10000000) // 0
    (5.00000000 0.00000000 -0.10000000) // 1
    (5.00000000 5.00000000 -0.10000000) // 2
    (0.00000000 5.00000000 -0.10000000) // 3
    (0.00000000 0.00000000 0.00000000) // 4
    (5.00000000 0.00000000 0.00000000) // 5
    (5.00000000 5.00000000 0.00000000) // 6
    (0.00000000 5.00000000 0.00000000) // 7
    (5.00000000 -5.00000000 -0.10000000) // 8
    (40.00000000 -5.00000000 -0.10000000) // 9
    (40.00000000 -2.50000000 -0.10000000) // 10
    (5.00000000 -2.50000000 -0.10000000) // 11
    (5.00000000 -5.00000000 0.00000000) // 12
    (40.00000000 -5.00000000 0.00000000) // 13
    (40.00000000 -2.50000000 0.00000000) // 14
    (5.00000000 -2.50000000 0.00000000) // 15
    (0.00000000 -2.50000000 -0.10000000) // 16
    (0.00000000 -2.50000000 0.00000000) // 17
    (40.00000000 0.00000000 -0.10000000) // 18
    (40.00000000 0.00000000 0.00000000) // 19
    (45.00000000 -2.50000000 -0.10000000) // 20
    (45.00000000 0.00000000 -0.10000000) // 21
    (45.00000000 -2.50000000 0.00000000) // 22
    (45.00000000 0.00000000 0.00000000) // 23
    (40.00000000 5.00000000 -0.10000000) // 24
    (40.00000000 5.00000000 0.00000000) // 25
    (5.00000000 7.50000000 -0.10000000) // 26
    (0.00000000 7.50000000 -0.10000000) // 27
    (5.00000000 7.50000000 0.00000000) // 28
    (0.00000000 7.50000000 0.00000000) // 29
    (40.00000000 7.50000000 -0.10000000) // 30
    (40.00000000 7.50000000 0.00000000) // 31
    (45.00000000 5.00000000 -0.10000000) // 32
    (45.00000000 7.50000000 -0.10000000) // 33
    (45.00000000 5.00000000 0.00000000) // 34
    (45.00000000 7.50000000 0.00000000) // 35
    (40.00000000 10.00000000 -0.10000000) // 36
    (5.00000000 10.00000000 -0.10000000) // 37
    (40.00000000 10.00000000 0.00000000) // 38
    (5.00000000 10.00000000 0.00000000) // 39
);

blocks
(
    // inlet
    hex  ( 0 1 2 3 4 5 6 7 )
    zone_fluid (21 21 1)  simpleGrading (1 1 1) // 0


    // layer 1 (opt)
    hex  ( 8 9 10 11 12 13 14 15 )
    zone_opt (141 11 1)  simpleGrading (1 1 1) // 1


    // layer 2 (solid, test_solid, solid)
    hex  ( 16 11 1 0 17 15 5 4 )
    zone_solid (21 11 1)  simpleGrading (1 1 1) // 2

    hex  ( 11 10 18 1 15 14 19 5 )
    zone_test_solid (141 11 1)  simpleGrading (1 1 1) // 3

    hex  ( 10 20 21 18 14 22 23 19 )
    zone_solid (21 11 1)  simpleGrading (1 1 1) // 4


    // layer 3 (test_fluid)
    hex  ( 1 18 24 2 5 19 25 6 )
    zone_test_fluid (141 21 1)  simpleGrading (1 1 1) // 5


    // layer 4 (solid, test_solid, solid)
    hex  ( 3 2 26 27 7 6 28 29 )
    zone_solid (21 11 1)  simpleGrading (1 1 1) // 6

    hex  ( 2 24 30 26 6 25 31 28 )
    zone_test_solid (141 11 1)  simpleGrading (1 1 1) // 7

    hex  ( 24 32 33 30 25 34 35 31 )
    zone_solid (21 11 1)  simpleGrading (1 1 1) // 8


    // layer 5 (opt)
    hex  ( 26 30 36 37 28 31 38 39 )
    zone_opt (141 11 1)  simpleGrading (1 1 1) // 9


    // outlet
    hex  ( 18 21 32 24 19 23 34 25 )
    zone_fluid (21 21 1)  simpleGrading (1 1 1) // 10
);

edges
(
    
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (0 1 2 3)
            (12 13 14 15)
            (8 9 10 11)
            (17 15 5 4)
            (16 11 1 0)
            (15 14 19 5)
            (11 10 18 1)
            (14 22 23 19)
            (10 20 21 18)
            (5 19 25 6)
            (1 18 24 2)
            (7 6 28 29)
            (3 2 26 27)
            (6 25 31 28)
            (2 24 30 26)
            (25 34 35 31)
            (24 32 33 30)
            (28 31 38 39)
            (26 30 36 37)
            (19 23 34 25)
            (18 21 32 24)
            
        );

    }

    outlet
    {
        type patch;
        faces
        (
            (23 21 32 34)
            
        );

    }

    force_in
    {
        type patch;
        faces
        (
            (17 16 0 4)
            (7 3 27 29)
            
        );

    }

    walls
    {
        type wall;
        faces
        (
            (12 8 11 15)
            (12 13 9 8)
            (13 9 10 14)
            (17 15 11 16)
            (14 22 20 10)
            (29 28 26 27)
            (31 35 33 30)
            (28 26 37 39)
            (39 38 36 37)
            (31 30 36 38)
            
        );

    }

    inlet
    {
        type patch;
        faces
        (
            (4 0 3 7)
            
        );

    }

    force_out
    {
        type patch;
        faces
        (
            (22 20 21 23)
            (34 32 33 35)
            
        );

    }
);

mergePatchPairs
();



faces
();


// ************************************************************************* //
