user_tutorial/thermFluidStructOptFoam/thermFluidStructOpt_2D_180deg/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(D|Da)"
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.9;
        smoother        GaussSeidel;
        nCellsInCoarsestLevel 20;
    }
    "(p|p_adj_U|p_adj_T)"
    {
        solver          GAMG;
        tolerance       1e-9;
        relTol          0.01;
        maxIter 		50;
		minIter 		0;
        smoother        GaussSeidel;
    }

    "(U|U_adj_U|U_adj_T|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-9;
        relTol          0.1;
    }
     "(T)"
    {
        solver          GAMG;
        preconditioner  DILU;
        smoother        GaussSeidel;
        tolerance       1e-5;
        relTol          0;
    } 
     "(T_adj)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0;
    }
     "(gamma_filter|obj_sens_T|cost_sens_power_loss|cost_sens_comp|cost_sens_vol_frac)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
 //   nCorrectors 2;
// nOuterCorrectors 10;
    pRefCell 0;
    pRefValue 0;

}

relaxationFactors
{
    fields
    {
        "(p|p_adj_U|p_adj_T)"     0.3;
        alpha           0.1;
    }
    equations
    {
        "(U|U_adj_U|U_adj_T)"     0.7;
        "(k|epsilon)"   0.7;
    }
}

inlet_outlet
{
    numberConstraintPatches      2;
    constraintPatchesNames       (inlet outlet);
}
constraintFunctionDict_solid
{
    numberConstraintPatches      1;
    constraintPatchesNames       (force);
}
// ************************************************************************* //
